raw/memory_scalability/sysbench-mem60-wt-ext4-wt2-pareto-100-oltp_ro.txt
sysbench 0.9:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


setting write concern to 1
Threads started!

[  10s] threads: 100, tps: 2470.56, reads: 32161.91, writes: 0.00, response time: 70.92ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 100, tps: 4142.40, reads: 53806.96, writes: 0.00, response time: 42.99ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 100, tps: 5921.68, reads: 76922.06, writes: 0.00, response time: 30.79ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 100, tps: 7615.22, reads: 98922.34, writes: 0.00, response time: 20.19ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 100, tps: 7805.50, reads: 101380.21, writes: 0.00, response time: 16.62ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 100, tps: 7805.30, reads: 101366.22, writes: 0.00, response time: 16.45ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 100, tps: 7860.79, reads: 102101.31, writes: 0.00, response time: 16.37ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 100, tps: 7880.81, reads: 102396.87, writes: 0.00, response time: 16.30ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 100, tps: 7865.29, reads: 102180.91, writes: 0.00, response time: 16.36ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 100, tps: 7880.61, reads: 102362.38, writes: 0.00, response time: 16.37ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 100, tps: 7904.30, reads: 102684.71, writes: 0.00, response time: 16.33ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 100, tps: 7881.90, reads: 102421.63, writes: 0.00, response time: 16.44ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 100, tps: 7891.80, reads: 102523.37, writes: 0.00, response time: 16.41ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 100, tps: 7899.60, reads: 102624.83, writes: 0.00, response time: 16.34ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 100, tps: 7844.19, reads: 101951.42, writes: 0.00, response time: 16.51ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 100, tps: 7871.49, reads: 102253.10, writes: 0.00, response time: 16.45ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 100, tps: 7841.21, reads: 101898.85, writes: 0.00, response time: 16.50ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 100, tps: 7871.09, reads: 102320.02, writes: 0.00, response time: 16.42ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            16923318
        write:                           0
        other:                           1302638
        total:                           18225956
    transactions:                        1302638 (7236.46 per sec.)
    read/write requests:                 16923318 (94013.03 per sec.)
    other operations:                    1302638 (7236.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.0103s
    total number of events:              1302638
    total time taken by event execution: 17997.0832s
    response time:
         min:                                  2.51ms
         avg:                                 13.82ms
         max:                                204.53ms
         approx.  95 percentile:              21.39ms

Threads fairness:
    events (avg/stddev):           13026.3800/28.33
    execution time (avg/stddev):   179.9708/0.01